{"dialog": {"Earth_Zaira": {"once": true, "object": "Earth", "events": ["Earth_touched"], "dialog": {"Hello Captain, I'm Zaira, the prosecutor of Traders Union on Earth. Before your first journey, let me introduce the life in space to you.": {"OK, go ahead!": {"While traveling through universe, your ship consumes fuel, but when you are on planet, you can move with planet for free.": {"Continue, please.": {"Your crew needs food. You can buy it on every planet as well as the fuel for your ship. During the long journeys, your crew can get crazy, so visit some planets from time to time.": {"Continue, please.": {"On planets, you can buy various goods for various prices. Buy the cheap one and sell it on other planets with profit!": null}}}}}, "Could you tell me something about Earth instead?": {"Well, Earth is the most developed planet in the Solar system. There is no heavy industry these days. We mainly develop high-end technology here and provide food for other planets.": null}, "Don't you have a job for me?": {"filter": ["!has_quest moon_water", "!finished_quest moon_water"], "I know it's always hard for new Captain to get a job, so I would have something small for you, if you're interested.": {"That would be awesome. What's that?": {"My friend Cassius on the Moon is waiting for another water extractor to get the water out of Moon regolith. He will give you 50 credits for the transport.": {"Sorry, that doesn't sound like a job for me": {"OK, I will have to find someone else then.": null}, "Yes, of course!": ["Great, so that's a deal", "add_item 9", "start_quest moon_water Transport water extractor to Moon."]}}, "Sorry, I'm able to find a job myself.": {"OK, as you wish.": null}}}}}, "face": "resources/face0.png"}, "Venus_Pearson": {"once": true, "object": "Venus", "events": ["Venus_touched"], "dialog": {"Welcome to Venus. I'm captain Pearson. I see you have nice ship. We are always looking for new brave men to help us fighting Candarians.": {"Hm, I don't think I would be good soldier, sorry.": {"OK, trader.": null}, "filter": ["!has_quest venus_guns"], "What would I need to do?": {"Well, at first, I will test you. You will have to destroy the ship flight by my best soldier.": {"OK, lets try it!": ["My soldier will be here soon.", "spawn_ship_copy x4 Cadet 1010 1020 [Player+6 Player+6 Player+3 Player+0 Player+0 Player+8]", "start_quest venus_test Destroy Captain Pearson's cadet's ship."]}}}, "Welcome to Venus. I'm captain Pearson. Cassius told me you should transport ray guns for us, is that right?": {"filter": ["has_quest venus_guns"], "Yes, I have the guns, give me 100 credits and we can finish our bussines.": {"Let me check the guns first, then I will give you the credits.": {"filter": ["has_item 10 20"], "OK, check the guns. They should be in good shape.": ["Right..., they look allright. Take your 100 credits, trader.", "remove_item 10 20", "finish_quest venus_guns", "add_credit 100"]}, "Hm, it seems you don't have 20 guns Cassius gave you. Come back once you will have them. Or did you steal them!?": {"filter": ["!has_item 10 20"], "No, I didn't steal them! I've just somehow lost some, I will come back later!": {"OK, trader.": null}}}}}, "face": "resources/face0.png"}, "venus_test_Pearson": {"once": false, "object": "", "events": ["Cadet_destroyed"], "dialog": ["Great, I see you will be good soldier, please come back to Venus for more instructions.", "finish_quest venus_test"], "face": "resources/face0.png"}, "Moon_Cassius": {"once": true, "object": "Moon", "events": ["Moon_touched"], "dialog": {"Ah, that's the guy who helped us with water extrator! I'm Cassius, the head of the Moon Industrial Area.": {"filter": ["finished_quest moon_water"], "Don't you have another job for me?": {"As you know, Solar system is preparing for war with Gandarians Republic. Most of the weapons are producted by Moon, but the main soldiers training center is on Venus.": {"filter": ["!has_quest venus_guns", "!finished_quest venus_guns"], "I see, you want me to transport guns to Venus. I can do that, but what's the reward?": {"Captain Pearson on Venus will give you 100 credits for this work.": {"Sorry, but that's not worth the job.": {"I don't think you will get better offer, but as you wish...": null}, "OK, lets make a deal.": ["Great, don't forget to go back here once you finish this job. I might have another one for you.", "start_quest venus_guns Transport guns to Captain Pearson on Venus", "add_item 10 20"]}}}}}, "Too bad you have not helped Zaira with the water extractor transport. But well, we will have to find someone else to do that job...": {"filter": ["!has_quest moon_water", "!finished_quest moon_water"]}, "Oh man, you have lost water extrator during your journey? That will cost you 150 credits.": {"filter": ["has_quest moon_water", "!has_item 9"], "Uh, sorry for that, I have no idea how that happened!": ["I'm sorry, but that's how it works here.", "remove_credit 150", "finish_quest moon_water"]}, "I see you have the water extractor on the board!": {"Yes, Zaira asked me to transport it to Moon for 50 credits.": ["Right, right... Here are you credits, thank you for your service!", "remove_item 9", "add_credit 50", "finish_quest moon_water"], "filter": ["has_quest moon_water", "has_item 9"]}}, "face": "resources/face1.png"}}}