{"dialog": {"Moon_touched": {"object": "Moon", "once": true, "events": ["Moon_touched"], "dialog": {"Too bad you have not helped Zaira with the wine transport. But well, we will have to find someone else to do that job...": {"filter": ["!has_quest wine_moon", "!finished_quest"]}, "I see you have the wine on the board!": {"Yes, Zaira asked me to transport it to Moon for 50 credits.": ["Right, right... Here are you credits, thank you for your service!", "remove_item 8", "add_credit 50", "finish_quest wine_moon"], "filter": ["has_quest wine_moon", "has_item 8"]}, "Oh man, you have drunk our wine during your trip? That will cost you 150 credits.": {"filter": ["has_quest wine_moon", "!has_item 8"], "That's not fair! We were really thirsty!": ["I'm sorry, but that's how it works here.", "remove_credit 150"]}}, "face": "resources/face1.png"}, "Earth_Zaira": {"once": true, "object": "Earth", "events": ["Earth_touched"], "dialog": {"Hello Captain, I'm Zaira, the prosecutor of Traders Union on Earth. Before your first journey, let me introduce the life in space to you.": {"OK, go ahead!": {"While traveling through universe, your ship consumes fuel, but when you are on planet, you can move with planet for free.": {"Continue, please.": {"Your crew needs food. You can buy it on every planet as well as the fuel for your ship. During the long journeys, your crew can get crazy, so visit some planets from time to time.": {"Continue, please.": "On planets, you can buy various goods for various prices. Buy the cheap one and sell it on other planets with profit!"}}}}, "Don't you have a job for me?": {"filter": ["!has_quest wine_moon", "!finished_quest wine_moon"], "I know it's always hard for new Caption to get a job, so I would have something small for you, if you're interested.": {"That would be awesome. What's that?": {"We have some boxes with wine here which should have been on the Moon already. Would you transport them there for 50 credits?": {"Sorry, that doesn't sound like a job for me": "OK, I will have to find someone else then.", "Yes, of course!": ["Great, so that's a deal", "add_item 8", "start_quest wine_moon"]}}, "Sorry, I'm able to find a job myself.": "OK, as you wish."}}}}, "face": "resources/face0.png"}}}